In [1]:
import pandas as pd

In [5]:
cars = pd.read_csv("C:/Gilbert/Kursus/Pandas_For_Python/Bagian_2_Part1_Pandas_From_hero_to_Zero/dataset/cars.csv")

In [6]:
cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevrolet s-10

In [11]:
cars.head(10).get('name',1)

0    chevrolet chevelle malibu
1            buick skylark 320
2           plymouth satellite
3                amc rebel sst
4                  ford torino
5             ford galaxie 500
6             chevrolet impala
7            plymouth fury iii
8             pontiac catalina
9           amc ambassador dpl
Name: name, dtype: object

In [13]:
cars['name'].iloc[0]

'chevrolet chevelle malibu'

In [14]:
cars.size

3582

In [18]:
jumlah_mobil = len(cars)
print("Kita mempunyai {} mobil".format(jumlah_mobil))

Kita mempunyai 398 mobil

In [29]:
pd.options.display.min_rows = 4

In [27]:
pd.options.display.max_rows = 20

In [30]:
cars.sort_values(by='horsepower',na_position='first')

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
32,25.0,4,98.0,NaN,2046,19.0,71,usa,ford pinto
126,21.0,6,200.0,NaN,2875,17.0,74,usa,ford maverick
...,...,...,...,...,...,...,...,...,...
13,14.0,8,455.0,225.0,3086,10.0,70,usa,buick estate wagon (sw)
116,16.0,8,400.0,230.0,4278,9.5,73,usa,pontiac grand prix

In [33]:
cars['horsepower'].max()

230.0